 # Taps
# tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'caskroom/versions'
# tap 'homebrew/bundle'
# tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install ZSH
# brew 'zsh'
# brew 'zsh-completions'
# brew 'zsh-syntax-highlighting'


# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
# Deprecated
# brew 'homebrew/dupes/grep'

# Install Java 8
# Deprecated
# cask 'java8'

# Install Binaries
brew 'git'
brew 'htop'
brew 'hub'
brew 'python3'
brew 'wget'
# brew 'xz'
brew 'you-get'
brew 'youtube-dl'

# PROCESSING
brew 'ant'
# brew 'ffmpeg --with-libvpx --with-libvorbis'
brew 'ffmpeg'
brew 'gradle'
brew 'lame'
# :brew 'libvpx'
brew 'x264'
# brew 'xvid'

# DEVELOPMENT
# brew 'php'
# brew 'composer'
# brew 'yarn'
# brew 'node-sass'
# brew 'sqlite'
# brew 'mysql'

# APPS
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'hazel'
# cask 'hyperkey'
cask 'karabiner-elements'
cask 'optimage'
cask 'processing'
# cask 'remembear'
# cask 'sublime-text'
cask 'visual-studio-code'
# cask 'toggl'
cask 'transmit'

# Quickook
# cask 'qlmarkdown'
# cask 'quicklook-csv'
