# Taps
# tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'caskroom/versions'
# tap 'homebrew/bundle'
# tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'doctl'
brew 'ffmpeg'
brew 'fzf'
brew 'gdbm'
brew 'git'
brew 'htop'
brew 'hub'
brew 'lame'
brew 'openssl'
brew 'pcre'
brew 'python3'
brew 'readline'
brew 'sqlite'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'xz'
brew 'you-get'
brew 'youtube-dl'

# Apps
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'amazon-drive'
cask 'appcleaner'
cask 'bartender'
cask 'choosy'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'figma'
cask 'google-chrome'
cask 'imageoptim'
cask 'keyboard-maestro'
cask 'mamp'
cask 'numi'
cask 'spotify'
cask 'sublime-text'
cask 'tyke'
# cask 'things'
# cask 'transmit'

# Quickook
cask 'qlmarkdown'
cask 'quicklook-csv'

# Install Mac App Store apps
# mas '1Password', id: 443987910
# mas 'HazeOver', id: 430798174
# mas 'Helium', id: 1054607607
# mas 'Magnet', id: 441258766
# mas 'Sketch', id: 402476602