 # Taps
# tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'caskroom/versions'
# tap 'homebrew/bundle'
# tap 'homebrew/dupes'
# tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'


# Install GNU core utilities (those that come with macOS are outdated)
# brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
# brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
# Deprecated
# brew 'homebrew/dupes/grep'

# Install Java 8
# Deprecated
# cask 'java8'

# Install Binaries
brew 'git'
brew 'htop'
brew 'hub'
brew 'python3'
brew 'wget'
brew 'xz'
brew 'you-get'
brew 'youtube-dl'

# PROCESSING
brew 'ant'
brew 'ffmpeg --with-libvpx --with-libvorbis'
brew 'gradle'
brew 'lame'
brew 'libvpx'
brew 'x264'
brew 'xvid'

# DEVELOPMENT
brew 'php'
brew 'composer'
brew 'yarn'
brew 'node-sass'
brew 'sqlite'


# APPS
cask 'alfred'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'hazel'
cask 'hiddenbar'
cask 'karabiner-elements'
cask 'nvalt'
cask 'numi'
cask 'optimage'
cask 'processing'
cask 'remembear'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'toggl'
cask 'transmit'

# Quickook
cask 'qlmarkdown'
cask 'quicklook-csv'

# Install Mac App Store apps
# mas '1Password', id: 443987910
# mas 'HazeOver', id: 430798174
# mas 'Helium', id: 1054607607
# mas 'Magnet', id: 441258766
# mas 'Sketch', id: 402476602
